{
  "generate_blocks_comment1": "Unicorn-magic-powered system that automatically adds tables/racks/shelves for all wood types in the game (yes, modded ones too, that is the point of this system). If you turn this off (does not work? please report!), workshop blocks will only be added in vanilla wood types.",
  "generate_blocks_comment2": "Option requires game restart. Will synchronize it in future versions, for now users need to be careful.",
  "generate_blocks_for_mod_added_woods": true,
  "blacklist_comment": "First and obvious use is to blacklist wood types that you really, really hate to see. Second and non-obvious use: say you have a duplicate wood type; normally it just gets recipes that give blocks of other type of same name; but if you really, really wish to have blocks of this type, black-list them here so that they are not added to dupes list and in blocks_with_dumbass_names setting in this file, add them in format modid:planks/slab/strippedlog; good example is Vinery mod which insists on cherry wood even in 1.20; if you do this, you get workshop blocks in vanilla cherry (light pink) and Vinery\u0027s cherry (dark red) separately. Oh, and asterisk after the colon works.",
  "blacklist": "vinery:cherry",
  "stripped_log_substitution_comment": "For wood types that do not have stripped logs, you can specify table top block here. If you do not, we are skipping that wood type.",
  "stripped_log_substitution_list_for_recipes": "bamboo\u003dminecraft:smooth_stone, treated_wood_horizontal\u003dminecraft:polished_blackstone,  embur\u003dbyg:stripped_embur_pedu,  sythian\u003dbyg:stripped_sythian_stem, bulbis\u003dminecraft:smooth_stone",
  "blocks_with_dumbass_names_comment": "This is a list of blocks that do not follow usual naming scheme. Set consists of planks, slab and log, separated by slashes. Separate all sets with comma. You can use stripped_log_substitution for these. Example is IE\u0027s treated wood as it has no logs.",
  "blocks_with_dumbass_names": "immersiveengineering:treated_wood_horizontal/slab_treated_wood_horizontal/no_log_for_this_one, growthcraft_apples:apple_plank/apple_plank_slab/apple_wood_log_stripped,   vinery:cherry_planks/cherry_slab/stripped_cherry_log"
}